RIET/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>crmGeoMarket</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmBusinessSegment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для офрмления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <comment>Признак того что в данном договоре организация выступает в качестве налогового агента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <comment>Разновидность договора с обязанностью оплаты организацией НДС в качестве налогового агента </comment>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SiebelID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SiebelName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <comment>ermPtDaysTo</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEng</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКНазванию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>EnumRef.СпособыРасчетаКомиссионногоВознаграждения</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоКурсуММВБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторВидовЭкономическойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>PIC_ID</name>
    <comment>(rgs) Sharepoint ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяChecklist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ermContractID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermSourceID</name>
    <comment>ID источника создания контракта</comment>
    <type>
      <types>CatalogRef.ermSourcesIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>crmContractID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmEffectiveDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermTrigger</name>
    <type>
      <types>CatalogRef.ermTriggerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>crmExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractCurrency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractValueUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmDFNName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermPtDaysFrom</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermНеИспользоватьPtDaysTo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermPtType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermCustomerID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermDocumentFlowPeriodFrom</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermDocumentFlowPeriodTo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermAmendment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ermAmendmentName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КодыCRMпоСегментам</name>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>crmContractID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PIC_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/AccumulationRegisters/ПродажиВыручка_SB/ПродажиВыручка_SB.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиВыручка_SB</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБезНДСRUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСRUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДСUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНаименованиеENG</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ОтчетАгентаПоРасходам</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлементаУправляемая/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
                    		
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
 	  
	//отбор ЗаказНаряды
	ЗначениеОтбора = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ЗаказНаряды.Параметры.УстановитьЗначениеПараметра("Договор", ЗначениеОтбора);
	            	 	
	// Проверка ведения однофирменности 
	Элементы.Организация.ТолькоПросмотр = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "УчетПоВсемОрганизациям");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ТекстНаименования = ?(Параметры.ЗначенияЗаполнения.Свойство("Наименование"), Параметры.ЗначенияЗаполнения.Наименование, ""); 
		ЗаполнитьНовыйЭлемент(ТекстНаименования);
	КонецЕсли;
	
	//Добавила Федотова Л., РГ-Софт, 14.10.15, вопрос SLI-0005864
	Исполнено = РассчитатьИсполнениеБюджетаПоДоговоруНаСервере();
	Элементы.ДекорацияИсполнениеБюджетаПоДоговору.Заголовок = "Исполнено: " + Исполнено;
	//
	УправлениеФормой(ЭтаФорма);
	
	//-> RG-Soft VIvanov 2016/08/16
	Если РольДоступна("ERMПравоТолькоИзмененияУсловийДоговоров") Тогда
		Элементы.ГруппаШапка.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Основные.Доступность = Ложь;
		Элементы.ГруппаSiebelWO.Доступность = Ложь;
		Элементы.ГруппаКодыCRMпоСегментам.Доступность = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ERMАналитика;
	КонецЕсли;
	//<- RG-Soft VIvanov 2016/08/16
     
КонецПроцедуры

//Добавила Федотова Л., РГ-Софт, 14.10.15, вопрос SLI-0005864
&НаКлиенте
Процедура РассчитатьИсполнениеБюджетаПоДоговору(Команда)
	Исполнено = 0;
	Если Объект.СуммаКонтракта > 0 Тогда
		ЗаполнитьРегистрИсполнениеБюджетаПоДоговору();
		Исполнено = РассчитатьИсполнениеБюджетаПоДоговоруНаСервере();
	КонецЕсли; 
	Элементы.ДекорацияИсполнениеБюджетаПоДоговору.Заголовок = "Исполнено: " + Исполнено;
КонецПроцедуры

//Добавила Федотова Л., РГ-Софт, 14.10.15, вопрос SLI-0005864
&НаСервере
Функция ЗаполнитьРегистрИсполнениеБюджетаПоДоговору()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПродажиВыручка_SB.Регистратор,
		|	ПродажиВыручка_SB.Период,
		|	ПродажиВыручка_SB.Регистратор.ВалютаДокумента КАК ВалютаДокумента,
		|	ПродажиВыручка_SB.Регистратор.КурсВзаиморасчетов КАК КурсВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ПродажиВыручка_SB КАК ПродажиВыручка_SB
		|ГДЕ
		|	ПродажиВыручка_SB.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И НЕ ПродажиВыручка_SB.Регистратор ССЫЛКА Документ.КорректировкаЗаписейРегистров";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписейИсполнениеБюджетаКонтракта = РегистрыНакопления.ИсполнениеБюджетаКонтракта.СоздатьНаборЗаписей();
		НаборЗаписейИсполнениеБюджетаКонтракта.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		НоваяЗапись = НаборЗаписейИсполнениеБюджетаКонтракта.Добавить();
		
		НоваяЗапись.ДоговорКонтрагента = Объект.Ссылка;
		НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Период;
		НоваяЗапись.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
		Если Объект.ВалютаВзаиморасчетов = ВыборкаДетальныеЗаписи.ВалютаДокумента Тогда 
			НоваяЗапись.Сумма = ВыборкаДетальныеЗаписи.Регистратор.СуммаДокумента;
		Иначе 	                                                     
			НоваяЗапись.Сумма = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ВыборкаДетальныеЗаписи.Регистратор.СуммаДокумента, ВыборкаДетальныеЗаписи.ВалютаДокумента, Объект.ВалютаВзаиморасчетов, ВыборкаДетальныеЗаписи.КурсВзаиморасчетов, ОбщегоНазначения.ПолучитьКурсВалюты(Объект.ВалютаВзаиморасчетов, ВыборкаДетальныеЗаписи.Период).Курс);
		КонецЕсли;
		НоваяЗапись.Активность = Истина;
		
		НаборЗаписейИсполнениеБюджетаКонтракта.Записать();
	КонецЦикла;
	
КонецФункции //ЗаполнитьРегистрИсполнениеБюджетаПоДоговору

//Добавила Федотова Л., РГ-Софт, 14.10.15, вопрос SLI-0005864
&НаСервере
Функция РассчитатьИсполнениеБюджетаПоДоговоруНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсполнениеБюджетаКонтрактаОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.ИсполнениеБюджетаКонтракта.Обороты КАК ИсполнениеБюджетаКонтрактаОбороты
	|ГДЕ
	|	ИсполнениеБюджетаКонтрактаОбороты.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОборот;
	КонецЦикла;
	Возврат 0;
	
КонецФункции // РассчитатьИсполнениеБюджетаПоДоговоруНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаказНаряды.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВедениеВзаиморасчетовПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.ВидДоговора)
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее")) Тогда
		Объект.ТипЦен = Неопределено;
		Объект.СпособРасчетаКомиссионногоВознаграждения = Неопределено;
		Объект.ПроцентКомиссионногоВознаграждения = 0;
		Объект.СрокОплаты = 0;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ВидДоговора)
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"))
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом")) Тогда
		Объект.РасчетыВУсловныхЕдиницах = Ложь;
		Если Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам") тогда
			Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом");
		КонецЕсли;
	КонецЕсли;

	//добавил Трефиленков Дмитрий, РГ-Софт
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
		Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам");
	КонецЕсли; //конец добавления

	Если (Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"))
			ИЛИ Объект.РасчетыВУсловныхЕдиницах Тогда
		Объект.РеализацияНаЭкспорт = Ложь;
	КонецЕсли;

	ЭтоДоговорПриобретения = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));

	Если НЕ ЭтоДоговорПриобретения Тогда
		Объект.УчетАгентскогоНДС = Ложь;
		Объект.ВидАгентскогоДоговора = Неопределено;
	КонецЕсли;

	Если Объект.УчетАгентскогоНДС
			И (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом")) Тогда
		Объект.ВидАгентскогоДоговора = ПредопределенноеЗначение("Перечисление.ВидыАгентскихДоговоров.Нерезидент");
	КонецЕсли;
	 
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)

	Если Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета и Объект.РасчетыВУсловныхЕдиницах Тогда
		Объект.РасчетыВУсловныхЕдиницах = Ложь;
	ИначеЕсли Объект.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета тогда
		Объект.РасчетыВУсловныхЕдиницах = Истина;
	КонецЕсли;
	Если Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета и Объект.РеализацияНаЭкспорт Тогда
		Объект.РеализацияНаЭкспорт = Ложь;
	КонецЕсли;

	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РасчетыВУсловныхЕдиницахПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
		Элементы.РеализацияНаЭкспорт.Доступность = Не Объект.РасчетыВУсловныхЕдиницах;
	КонецЕсли;

	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеализацияНаЭкспортПриИзменении(Элемент)

	Элементы.РасчетыВУсловныхЕдиницах.Доступность = Не Объект.РеализацияНаЭкспорт;

	УправлениеФормой(ЭтаФорма);

КонецПроцедуры
     
&НаКлиенте
Процедура УчетАгентскогоНДСПриИзменении(Элемент)

	Если Объект.УчетАгентскогоНДС Тогда
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом") Тогда
			Объект.ВидАгентскогоДоговора = ПредопределенноеЗначение("Перечисление.ВидыАгентскихДоговоров.Нерезидент");
		Иначе
			Объект.ВидАгентскогоДоговора = ПредопределенноеЗначение("Перечисление.ВидыАгентскихДоговоров.Аренда");
		КонецЕсли;
		Объект.РасчетыВУсловныхЕдиницах = Ложь;
	Иначе
		Объект.ВидАгентскогоДоговора = Неопределено;
	КонецЕсли;

	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЗАКАЗНАРЯДЫ

&НаКлиенте
Процедура ЗаказНарядыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Если Вопрос("Записать документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда 
			Возврат;
		КонецЕсли;
		
		Если Не Записать(Новый Структура) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Не удалось записать текущий документ, "
				+ ОписаниеОшибки());
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ЗаказНаряды.Форма.ФормаЭлемента", Новый Структура("Договор", Объект.Ссылка), ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьНовыйЭлемент(ТекстНаименования) 

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Объект.Наименование = СокрЛП(ТекстНаименования);
	
	//добавил Трефиленков Дмитрий, РГ-Софт
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Объект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам;
	КонецЕсли; //конец добавления
	
	Если Не ЗначениеЗаполнено(Объект.ВедениеВзаиморасчетов) Тогда
		Объект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		Объект.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяВалютаВзаиморасчетов");
		Если Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
			Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Объект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация");
		
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|Организации.Ссылка КАК ОрганизацияСсылка,
			|Организации.НаименованиеПолное
			|ИЗ
			|Справочник.Организации КАК Организации
			|";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.Организация = Выборка.ОрганизацияСсылка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ВидДоговора) 
		И Не ЗначениеЗаполнено(Объект.Владелец) Тогда
			Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьНовыйЭлемент()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	ВалютаРегламентированногоУчета = Форма.ВалютаРегламентированногоУчета;

	ЭтоДоговорКомиссии     = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
		
	ЭтоДоговорПриобретения = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
		
	ЭтоДоговорРеализации   = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
	
	ДоступностьКомиссионногоВознаграждения = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
		
	//Группа "Ведение взаиморасчетов"

	Элементы.РеализацияНаЭкспорт.Доступность =
		(Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"))
		И (Объект.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета)
		И НЕ Объект.РасчетыВУсловныхЕдиницах;
                  	
	Если (ЭтоДоговорРеализации или Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")) Тогда
		
		Если Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета тогда
			Элементы.РасчетыВУсловныхЕдиницах.Доступность = Ложь;
			Элементы.Курс.Доступность = Ложь;
		ИначеЕсли Объект.УчетАгентскогоНДС тогда
			Элементы.РасчетыВУсловныхЕдиницах.Доступность = Ложь;
			Элементы.Курс.Доступность = Ложь;
		ИначеЕсли Объект.РеализацияНаЭкспорт Тогда
			Элементы.РасчетыВУсловныхЕдиницах.Доступность = Ложь;
			Элементы.Курс.Доступность = Ложь;
		Иначе
			Элементы.РасчетыВУсловныхЕдиницах.Доступность = Истина;
			Элементы.Курс.Доступность = Истина;
		Конецесли;

	Иначе
		Элементы.РасчетыВУсловныхЕдиницах.Доступность	= Ложь;
		Элементы.ВедениеВзаиморасчетов.Доступность		= Ложь;
		Элементы.Курс.Доступность = Ложь;
	КонецЕсли;

	//добавила Федотова Людмила, РГ-Софт
	Элементы.ВедениеВзаиморасчетов.Доступность = (Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		
	//Группа "Комиссионное вознаграждение"

	Элементы.ГруппаКомиссионноеВознаграждение.Доступность = ДоступностьКомиссионногоВознаграждения;

	//Группа "НДС"

	Если Не ЭтоДоговорРеализации Тогда
		Элементы.ГруппаНДСПоНалоговомуАгенту.Доступность = ЭтоДоговорПриобретения;
		Элементы.ВидАгентскогоДоговора.Доступность = (ЭтоДоговорПриобретения И Объект.УчетАгентскогоНДС И НЕ ЭтоДоговорКомиссии);
	КонецЕсли;
	
	// { RGS VChaplygin 11.08.2016 10:08:47 - Доработка для ERM
	ermAmendmentПриИзмененииНаСервере(Форма);
	// } RGS VChaplygin 11.08.2016 10:09:09 - Доработка для ERM
	 
КонецПроцедуры

//-> RG-Soft VIvanov 2016/08/10
&НаКлиенте
Процедура crmContractIDНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.crmContracts.ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура crmContractIDОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЗаполнитьРеквизитыCRM(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыCRM(ВыбранноеЗначение)
	
	Объект.crmContractID = ВыбранноеЗначение.Код;
	Объект.crmContractName = ВыбранноеЗначение.Наименование;
	Объект.crmDFNName = ВыбранноеЗначение.crmDFNName;
	Объект.crmCreatedBy = ВыбранноеЗначение.crmCreatedBy;
	Объект.crmContractCurrency = ВыбранноеЗначение.crmContractCurrency;
	Объект.crmContractValueUSD = ВыбранноеЗначение.crmContractValueUSD;
	Объект.crmCreatedDate = ВыбранноеЗначение.crmCreatedDate;
	Объект.crmEffectiveDate = ВыбранноеЗначение.crmEffectiveDate;
	Объект.crmExpiryDate = ВыбранноеЗначение.crmExpiryDate;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ermAmendmentПриИзмененииНаСервере(Форма)
	
	Объект = Форма.Объект;
	ermAmendmentNameEnable = Объект.ermAmendment;
	Если НЕ ermAmendmentNameEnable Тогда
		Объект.ermAmendmentName = "";
	КонецЕсли;
	
	Форма.Элементы.ermAmendmentName.Доступность = ermAmendmentNameEnable;
	
КонецПроцедуры

&НаКлиенте
Процедура ermAmendmentПриИзменении(Элемент)
	
	ermAmendmentПриИзмененииНаСервере(ЭтаФорма);

КонецПроцедуры
//<- RG-Soft VIvanov 2016/08/10
